---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurveFailures.CurveNotEditableWarn
source: html/24690228-84ec-5959-fc5b-6c8fca307b95.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurveFailures.CurveNotEditableWarn Property

Lines created by massing or picking 3d path are not editable.

## Syntax (C#)
```csharp
public static FailureDefinitionId CurveNotEditableWarn { get; }
```